20230202234553-inbox.org
:PROPERTIES:
:ID:       007116d4-5023-4070-95ee-0a463b4bd983
:END:
#+title: Inbox
* 概要
とりあえず入れておくページ。
* Memo
* Tasks
* Reference
* Inbox
** [[https://krkrz.github.io/krkr2doc/kag3doc/contents/Tags.html][タグリファレンス]]
吉里吉里のタグリファレンス。
** [[https://www.jst.go.jp/pr/info/info708/index.html][粘菌の輸送ネットワークから都市構造の設計理論を構築―都市間を結ぶ最適な道路・鉄道網の法則確立に期待―]]
最適なネットワーク構築の研究。
** [[https://game-materials.com/][【フリー素材】ゲームまてりあるず｜無料の背景イラスト | フリーの背景素材集]]
いい感じの背景素材。
** [[https://www.digital.archives.go.jp/DAS/pickup/view/detail/detailArchives/0301000000/0000000231/00][薩摩国（元禄）]]
江戸時代の地図。
** [[https://www.digital.archives.go.jp/DAS/meta/listPhoto?LANG=default&BID=F1000000000000001212&ID=M2008032521114289505&TYPE=large][日本国地理測量之図]]
江戸時代だと、折口まわりは全然載ってない。
** [[https://catalog.lib.kyushu-u.ac.jp/opac_detail_md/?reqCode=frombib&lang=0&amode=MD820&opkey=&bibid=4066828&start=][西海道全圖 - 九大コレクション | 九州大学附属図書館]]
記載がある。
** [[https://rmda.kulib.kyoto-u.ac.jp/item/rb00023965#?c=0&m=0&s=0&cv=0&r=0&xywh=669%2C7526%2C5352%2C858][大日本帝國豫察西南部地質圖. | 京都大学貴重資料デジタルアーカイブ]]
明治28年の地質図。
** [[https://speakerdeck.com/akeno/oapi-codegenwoshi-tutemita?slide=24][oapi-codegenを使ってみた - Speaker Deck]]
oapi-codegenの使い方。とくにバリデーションが参考になる。
** [[https://note.crohaco.net/2020/gorp-unittest-with-db/][[Golang] gorpでDBを使ったユニットテストを書くたったひとつの冴えたやりかた - くろのて]]
factory-botを便利に使う方法。
** TODO [[https://www.youtube.com/watch?v=SrGvI85h6Mk&list=PLDJfzGjtVLHnc1vTpBaCNKMUl6HauQv1a&index=6][【大学数学】線形代数入門⑥(連立方程式：不定と不能)【線形代数】 - YouTube]]

- 連立方程式の不定と不能

** [[https://gigazine.net/news/20130502-mcdonalds-theory/][「マクドナルド理論」を使うとより優れたアイデアが出てきてプロジェクトが進行する - GIGAZINE]]
マクドナルドはやめようとなって対案が出てくる現象。
** [[https://ja.wikipedia.org/wiki/Category:%E3%82%A8%E3%83%89%E3%82%AC%E3%83%BC%E3%83%BB%E3%83%80%E3%82%A4%E3%82%AF%E3%82%B9%E3%83%88%E3%83%A9][Category:エドガー・ダイクストラ - Wikipedia]]
ダイクストラにはカテゴリページがある。
** [[https://ja.wikipedia.org/wiki/%E3%82%BD%E3%83%95%E3%82%A3%E3%83%86%E3%83%AB%E6%9D%B1%E4%BA%AC][ソフィテル東京 - Wikipedia]]
一時期不忍池にあったビル。
** TODO [[https://gihyo.jp/dp/ebook/2015/978-4-7741-7596-6][2Dグラフィックスのしくみ ――図解でよくわかる画像処理技術のセオリー | Gihyo Digital Publishing]]
:PROPERTIES:
:Effort:   2:00
:END:
:LOGBOOK:
CLOCK: [2023-12-24 Sun 08:11]--[2023-12-24 Sun 08:36] =>  0:25
CLOCK: [2023-12-24 Sun 00:52]--[2023-12-24 Sun 01:17] =>  0:25
:END:
解説本。
** TODO [[https://gihyo.jp/dp/ebook/2018/978-4-7741-9659-6][増補改訂版 図解でわかる はじめてのデジタル画像処理 | Gihyo Digital Publishing]]
画像処理の解説本。
