20230202234553-inbox.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-25 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Inbox</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">Inbox</h1>
<div id="outline-container-orgf5de8e5" class="outline-2">
<h2 id="orgf5de8e5"><a href="#orgf5de8e5">概要</a></h2>
<div class="outline-text-2" id="text-orgf5de8e5">
<p>
とりあえず入れておくページ。
</p>
</div>
</div>
<div id="outline-container-orgb8ae16b" class="outline-2">
<h2 id="orgb8ae16b"><a href="#orgb8ae16b">Memo</a></h2>
</div>
<div id="outline-container-org1491b6a" class="outline-2">
<h2 id="org1491b6a"><a href="#org1491b6a">Tasks</a></h2>
</div>
<div id="outline-container-org11b6789" class="outline-2">
<h2 id="org11b6789"><a href="#org11b6789">Reference</a></h2>
</div>
<div id="outline-container-orgfbd81c1" class="outline-2">
<h2 id="orgfbd81c1"><a href="#orgfbd81c1">Inbox</a></h2>
<div class="outline-text-2" id="text-orgfbd81c1">
</div>
<div id="outline-container-org079351e" class="outline-3">
<h3 id="org079351e"><a href="#org079351e"><a href="https://krkrz.github.io/krkr2doc/kag3doc/contents/Tags.html">タグリファレンス</a></a></h3>
<div class="outline-text-3" id="text-org079351e">
<p>
吉里吉里のタグリファレンス。
</p>
</div>
</div>
<div id="outline-container-org5d61858" class="outline-3">
<h3 id="org5d61858"><a href="#org5d61858"><a href="https://www.jst.go.jp/pr/info/info708/index.html">粘菌の輸送ネットワークから都市構造の設計理論を構築―都市間を結ぶ最適な道路・鉄道網の法則確立に期待―</a></a></h3>
<div class="outline-text-3" id="text-org5d61858">
<p>
最適なネットワーク構築の研究。
</p>
</div>
</div>
<div id="outline-container-orge7c4c6a" class="outline-3">
<h3 id="orge7c4c6a"><a href="#orge7c4c6a"><a href="https://game-materials.com/">【フリー素材】ゲームまてりあるず｜無料の背景イラスト | フリーの背景素材集</a></a></h3>
<div class="outline-text-3" id="text-orge7c4c6a">
<p>
いい感じの背景素材。
</p>
</div>
</div>
<div id="outline-container-org4345945" class="outline-3">
<h3 id="org4345945"><a href="#org4345945"><a href="https://www.digital.archives.go.jp/DAS/pickup/view/detail/detailArchives/0301000000/0000000231/00">薩摩国（元禄）</a></a></h3>
<div class="outline-text-3" id="text-org4345945">
<p>
江戸時代の地図。
</p>
</div>
</div>
<div id="outline-container-orge552037" class="outline-3">
<h3 id="orge552037"><a href="#orge552037"><a href="https://www.digital.archives.go.jp/DAS/meta/listPhoto?LANG=default&amp;BID=F1000000000000001212&amp;ID=M2008032521114289505&amp;TYPE=large">日本国地理測量之図</a></a></h3>
<div class="outline-text-3" id="text-orge552037">
<p>
江戸時代だと、折口まわりは全然載ってない。
</p>
</div>
</div>
<div id="outline-container-org25dffe9" class="outline-3">
<h3 id="org25dffe9"><a href="#org25dffe9"><a href="https://catalog.lib.kyushu-u.ac.jp/opac_detail_md/?reqCode=frombib&amp;lang=0&amp;amode=MD820&amp;opkey=&amp;bibid=4066828&amp;start=">西海道全圖 - 九大コレクション | 九州大学附属図書館</a></a></h3>
<div class="outline-text-3" id="text-org25dffe9">
<p>
記載がある。
</p>
</div>
</div>
<div id="outline-container-org3c6e591" class="outline-3">
<h3 id="org3c6e591"><a href="#org3c6e591"><a href="https://rmda.kulib.kyoto-u.ac.jp/item/rb00023965#?c=0&amp;m=0&amp;s=0&amp;cv=0&amp;r=0&amp;xywh=669%2C7526%2C5352%2C858">大日本帝國豫察西南部地質圖. | 京都大学貴重資料デジタルアーカイブ</a></a></h3>
<div class="outline-text-3" id="text-org3c6e591">
<p>
明治28年の地質図。
</p>
</div>
</div>
<div id="outline-container-org0e0f5e6" class="outline-3">
<h3 id="org0e0f5e6"><a href="#org0e0f5e6"><a href="https://speakerdeck.com/akeno/oapi-codegenwoshi-tutemita?slide=24">oapi-codegenを使ってみた - Speaker Deck</a></a></h3>
<div class="outline-text-3" id="text-org0e0f5e6">
<p>
oapi-codegenの使い方。とくにバリデーションが参考になる。
</p>
</div>
</div>
<div id="outline-container-org4f16fc8" class="outline-3">
<h3 id="org4f16fc8"><a href="#org4f16fc8"><a href="https://note.crohaco.net/2020/gorp-unittest-with-db/">[Golang] gorpでDBを使ったユニットテストを書くたったひとつの冴えたやりかた - くろのて</a></a></h3>
<div class="outline-text-3" id="text-org4f16fc8">
<p>
factory-botを便利に使う方法。
</p>
</div>
</div>
<div id="outline-container-orgc1de7d3" class="outline-3">
<h3 id="orgc1de7d3"><a href="#orgc1de7d3"><span class="todo TODO">TODO</span> <a href="https://www.youtube.com/watch?v=SrGvI85h6Mk&amp;list=PLDJfzGjtVLHnc1vTpBaCNKMUl6HauQv1a&amp;index=6">【大学数学】線形代数入門⑥(連立方程式：不定と不能)【線形代数】 - YouTube</a></a></h3>
<div class="outline-text-3" id="text-orgc1de7d3">
<ul class="org-ul">
<li>連立方程式の不定と不能</li>
</ul>
</div>
</div>

<div id="outline-container-org42f1657" class="outline-3">
<h3 id="org42f1657"><a href="#org42f1657"><a href="https://gigazine.net/news/20130502-mcdonalds-theory/">「マクドナルド理論」を使うとより優れたアイデアが出てきてプロジェクトが進行する - GIGAZINE</a></a></h3>
<div class="outline-text-3" id="text-org42f1657">
<p>
マクドナルドはやめようとなって対案が出てくる現象。
</p>
</div>
</div>
<div id="outline-container-orgbf414fb" class="outline-3">
<h3 id="orgbf414fb"><a href="#orgbf414fb"><a href="https://ja.wikipedia.org/wiki/Category:%E3%82%A8%E3%83%89%E3%82%AC%E3%83%BC%E3%83%BB%E3%83%80%E3%82%A4%E3%82%AF%E3%82%B9%E3%83%88%E3%83%A9">Category:エドガー・ダイクストラ - Wikipedia</a></a></h3>
<div class="outline-text-3" id="text-orgbf414fb">
<p>
ダイクストラにはカテゴリページがある。
</p>
</div>
</div>
<div id="outline-container-org9ab8531" class="outline-3">
<h3 id="org9ab8531"><a href="#org9ab8531"><a href="https://ja.wikipedia.org/wiki/%E3%82%BD%E3%83%95%E3%82%A3%E3%83%86%E3%83%AB%E6%9D%B1%E4%BA%AC">ソフィテル東京 - Wikipedia</a></a></h3>
<div class="outline-text-3" id="text-org9ab8531">
<p>
一時期不忍池にあったビル。
</p>
</div>
</div>
<div id="outline-container-org9a6154d" class="outline-3">
<h3 id="org9a6154d"><a href="#org9a6154d"><span class="todo TODO">TODO</span> <a href="https://gihyo.jp/dp/ebook/2015/978-4-7741-7596-6">2Dグラフィックスのしくみ ――図解でよくわかる画像処理技術のセオリー | Gihyo Digital Publishing</a></a></h3>
<div class="outline-text-3" id="text-org9a6154d">
<p>
解説本。
</p>
</div>
</div>
<div id="outline-container-org2300a39" class="outline-3">
<h3 id="org2300a39"><a href="#org2300a39"><span class="todo TODO">TODO</span> <a href="https://gihyo.jp/dp/ebook/2018/978-4-7741-9659-6">増補改訂版 図解でわかる はじめてのデジタル画像処理 | Gihyo Digital Publishing</a></a></h3>
<div class="outline-text-3" id="text-org2300a39">
<p>
画像処理の解説本。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
